{"format": "layers-model", "generatedBy": "keras v2.10.0", "convertedBy": "TensorFlow.js Converter v3.21.0", "modelTopology": {"keras_version": "2.10.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "NASNet", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_4"}, "name": "input_4", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "stem_conv1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stem_conv1", "inbound_nodes": [[["input_4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stem_bn1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9997, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stem_bn1", "inbound_nodes": [[["stem_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation", "inbound_nodes": [[["stem_bn1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "reduction_conv_1_stem_1", "trainable": true, "dtype": "float32", "filters": 11, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "reduction_conv_1_stem_1", "inbound_nodes": [[["activation", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "reduction_bn_1_stem_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9997, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "reduction_bn_1_stem_1", "inbound_nodes": [[["reduction_conv_1_stem_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_1", "inbound_nodes": [[["reduction_bn_1_stem_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_3", "inbound_nodes": [[["stem_bn1", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "separable_conv_1_pad_reduction_left1_stem_1", "trainable": true, "dtype": "float32", "padding": [[2, 2], [2, 2]], "data_format": "channels_last"}, "name": "separable_conv_1_pad_reduction_left1_stem_1", "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "separable_conv_1_pad_reduction_right1_stem_1", "trainable": true, "dtype": "float32", "padding": [[3, 3], [3, 3]], "data_format": "channels_last"}, "name": "separable_conv_1_pad_reduction_right1_stem_1", "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "separable_conv_1_reduction_left1_stem_1", "trainable": true, "dtype": "float32", "filters": 11, "kernel_size": [5, 5], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 24}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "separable_conv_1_reduction_left1_stem_1", "inbound_nodes": [[["separable_conv_1_pad_reduction_left1_stem_1", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "separable_conv_1_reduction_right1_stem_1", "trainable": true, "dtype": "float32", "filters": 11, "kernel_size": [7, 7], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 29}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "separable_conv_1_reduction_right1_stem_1", "inbound_nodes": [[["separable_conv_1_pad_reduction_right1_stem_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "separable_conv_1_bn_reduction_left1_stem_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9997, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "separable_conv_1_bn_reduction_left1_stem_1", "inbound_nodes": [[["separable_conv_1_reduction_left1_stem_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "separable_conv_1_bn_reduction_right1_stem_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9997, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "separable_conv_1_bn_reduction_right1_stem_1", "inbound_nodes": [[["separable_conv_1_reduction_right1_stem_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_2", "inbound_nodes": [[["separable_conv_1_bn_reduction_left1_stem_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_4", "inbound_nodes": [[["separable_conv_1_bn_reduction_right1_stem_1", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "separable_conv_2_reduction_left1_stem_1", "trainable": true, "dtype": "float32", "filters": 11, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 46}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "separable_conv_2_reduction_left1_stem_1", "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "separable_conv_2_reduction_right1_stem_1", "trainable": true, "dtype": "float32", "filters": 11, "kernel_size": [7, 7], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 51}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "separable_conv_2_reduction_right1_stem_1", "inbound_nodes": [[["activation_4", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_5", "inbound_nodes": [[["stem_bn1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "separable_conv_2_bn_reduction_left1_stem_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9997, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "separable_conv_2_bn_reduction_left1_stem_1", "inbound_nodes": [[["separable_conv_2_reduction_left1_stem_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "separable_conv_2_bn_reduction_right1_stem_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9997, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "separable_conv_2_bn_reduction_right1_stem_1", "inbound_nodes": [[["separable_conv_2_reduction_right1_stem_1", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "separable_conv_1_pad_reduction_right2_stem_1", "trainable": true, "dtype": "float32", "padding": [[3, 3], [3, 3]], "data_format": "channels_last"}, "name": "separable_conv_1_pad_reduction_right2_stem_1", "inbound_nodes": [[["activation_5", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_7", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_7", "inbound_nodes": [[["stem_bn1", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "reduction_add_1_stem_1", "trainable": true, "dtype": "float32"}, "name": "reduction_add_1_stem_1", "inbound_nodes": [[["separable_conv_2_bn_reduction_left1_stem_1", 0, 0, {}], ["separable_conv_2_bn_reduction_right1_stem_1", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "separable_conv_1_reduction_right2_stem_1", "trainable": true, "dtype": "float32", "filters": 11, "kernel_size": [7, 7], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 70}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "separable_conv_1_reduction_right2_stem_1", "inbound_nodes": [[["separable_conv_1_pad_reduction_right2_stem_1", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "separable_conv_1_pad_reduction_right3_stem_1", "trainable": true, "dtype": "float32", "padding": [[2, 2], [2, 2]], "data_format": "channels_last"}, "name": "separable_conv_1_pad_reduction_right3_stem_1", "inbound_nodes": [[["activation_7", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_9", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_9", "inbound_nodes": [[["reduction_add_1_stem_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "separable_conv_1_bn_reduction_right2_stem_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9997, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "separable_conv_1_bn_reduction_right2_stem_1", "inbound_nodes": [[["separable_conv_1_reduction_right2_stem_1", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "separable_conv_1_reduction_right3_stem_1", "trainable": true, "dtype": "float32", "filters": 11, "kernel_size": [5, 5], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 82}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "separable_conv_1_reduction_right3_stem_1", "inbound_nodes": [[["separable_conv_1_pad_reduction_right3_stem_1", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "separable_conv_1_reduction_left4_stem_1", "trainable": true, "dtype": "float32", "filters": 11, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 87}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "separable_conv_1_reduction_left4_stem_1", "inbound_nodes": [[["activation_9", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_6", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_6", "inbound_nodes": [[["separable_conv_1_bn_reduction_right2_stem_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "separable_conv_1_bn_reduction_right3_stem_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9997, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "separable_conv_1_bn_reduction_right3_stem_1", "inbound_nodes": [[["separable_conv_1_reduction_right3_stem_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "separable_conv_1_bn_reduction_left4_stem_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9997, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "separable_conv_1_bn_reduction_left4_stem_1", "inbound_nodes": [[["separable_conv_1_reduction_left4_stem_1", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "reduction_pad_1_stem_1", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "reduction_pad_1_stem_1", "inbound_nodes": [[["reduction_bn_1_stem_1", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "separable_conv_2_reduction_right2_stem_1", "trainable": true, "dtype": "float32", "filters": 11, "kernel_size": [7, 7], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 104}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "separable_conv_2_reduction_right2_stem_1", "inbound_nodes": [[["activation_6", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_8", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_8", "inbound_nodes": [[["separable_conv_1_bn_reduction_right3_stem_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_10", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_10", "inbound_nodes": [[["separable_conv_1_bn_reduction_left4_stem_1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "reduction_left2_stem_1", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "reduction_left2_stem_1", "inbound_nodes": [[["reduction_pad_1_stem_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "separable_conv_2_bn_reduction_right2_stem_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9997, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "separable_conv_2_bn_reduction_right2_stem_1", "inbound_nodes": [[["separable_conv_2_reduction_right2_stem_1", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "separable_conv_2_reduction_right3_stem_1", "trainable": true, "dtype": "float32", "filters": 11, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 117}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "separable_conv_2_reduction_right3_stem_1", "inbound_nodes": [[["activation_8", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "separable_conv_2_reduction_left4_stem_1", "trainable": true, "dtype": "float32", "filters": 11, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 122}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "separable_conv_2_reduction_left4_stem_1", "inbound_nodes": [[["activation_10", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "adjust_relu_1_stem_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "adjust_relu_1_stem_2", "inbound_nodes": [[["stem_bn1", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "reduction_add_2_stem_1", "trainable": true, "dtype": "float32"}, "name": "reduction_add_2_stem_1", "inbound_nodes": [[["reduction_left2_stem_1", 0, 0, {}], ["separable_conv_2_bn_reduction_right2_stem_1", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "reduction_left3_stem_1", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "reduction_left3_stem_1", "inbound_nodes": [[["reduction_pad_1_stem_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "separable_conv_2_bn_reduction_right3_stem_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9997, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "separable_conv_2_bn_reduction_right3_stem_1", "inbound_nodes": [[["separable_conv_2_reduction_right3_stem_1", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "reduction_left4_stem_1", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "name": "reduction_left4_stem_1", "inbound_nodes": [[["reduction_add_1_stem_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "separable_conv_2_bn_reduction_left4_stem_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9997, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "separable_conv_2_bn_reduction_left4_stem_1", "inbound_nodes": [[["separable_conv_2_reduction_left4_stem_1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "reduction_right5_stem_1", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "reduction_right5_stem_1", "inbound_nodes": [[["reduction_pad_1_stem_1", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_6", "trainable": true, "dtype": "float32", "padding": [[0, 1], [0, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_6", "inbound_nodes": [[["adjust_relu_1_stem_2", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "reduction_add3_stem_1", "trainable": true, "dtype": "float32"}, "name": "reduction_add3_stem_1", "inbound_nodes": [[["reduction_left3_stem_1", 0, 0, {}], ["separable_conv_2_bn_reduction_right3_stem_1", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add", "trainable": true, "dtype": "float32"}, "name": "add", "inbound_nodes": [[["reduction_add_2_stem_1", 0, 0, {}], ["reduction_left4_stem_1", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "reduction_add4_stem_1", "trainable": true, "dtype": "float32"}, "name": "reduction_add4_stem_1", "inbound_nodes": [[["separable_conv_2_bn_reduction_left4_stem_1", 0, 0, {}], ["reduction_right5_stem_1", 0, 0, {}]]]}, {"class_name": "Cropping2D", "config": {"name": "cropping2d", "trainable": true, "dtype": "float32", "cropping": [[1, 0], [1, 0]], "data_format": "channels_last"}, "name": "cropping2d", "inbound_nodes": [[["zero_padding2d_6", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "reduction_concat_stem_1", "trainable": true, "dtype": "float32", "axis": -1}, "name": "reduction_concat_stem_1", "inbound_nodes": [[["reduction_add_2_stem_1", 0, 0, {}], ["reduction_add3_stem_1", 0, 0, {}], ["add", 0, 0, {}], ["reduction_add4_stem_1", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "adjust_avg_pool_1_stem_2", "trainable": true, "dtype": "float32", "pool_size": [1, 1], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "adjust_avg_pool_1_stem_2", "inbound_nodes": [[["adjust_relu_1_stem_2", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "adjust_avg_pool_2_stem_2", "trainable": true, "dtype": "float32", "pool_size": [1, 1], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "adjust_avg_pool_2_stem_2", "inbound_nodes": [[["cropping2d", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_11", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_11", "inbound_nodes": [[["reduction_concat_stem_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "adjust_conv_1_stem_2", "trainable": true, "dtype": "float32", "filters": 11, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "adjust_conv_1_stem_2", "inbound_nodes": [[["adjust_avg_pool_1_stem_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "adjust_conv_2_stem_2", "trainable": true, "dtype": "float32", "filters": 11, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "adjust_conv_2_stem_2", "inbound_nodes": [[["adjust_avg_pool_2_stem_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "reduction_conv_1_stem_2", "trainable": true, "dtype": "float32", "filters": 22, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "reduction_conv_1_stem_2", "inbound_nodes": [[["activation_11", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate", "inbound_nodes": [[["adjust_conv_1_stem_2", 0, 0, {}], ["adjust_conv_2_stem_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "reduction_bn_1_stem_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9997, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "reduction_bn_1_stem_2", "inbound_nodes": [[["reduction_conv_1_stem_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "adjust_bn_stem_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9997, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "adjust_bn_stem_2", "inbound_nodes": [[["concatenate", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_12", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_12", "inbound_nodes": [[["reduction_bn_1_stem_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_14", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_14", "inbound_nodes": [[["adjust_bn_stem_2", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "separable_conv_1_pad_reduction_left1_stem_2", "trainable": true, "dtype": "float32", "padding": [[1, 2], [1, 2]], "data_format": "channels_last"}, "name": "separable_conv_1_pad_reduction_left1_stem_2", "inbound_nodes": [[["activation_12", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "separable_conv_1_pad_reduction_right1_stem_2", "trainable": true, "dtype": "float32", "padding": [[2, 3], [2, 3]], "data_format": "channels_last"}, "name": "separable_conv_1_pad_reduction_right1_stem_2", "inbound_nodes": [[["activation_14", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "separable_conv_1_reduction_left1_stem_2", "trainable": true, "dtype": "float32", "filters": 22, "kernel_size": [5, 5], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 175}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "separable_conv_1_reduction_left1_stem_2", "inbound_nodes": [[["separable_conv_1_pad_reduction_left1_stem_2", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "separable_conv_1_reduction_right1_stem_2", "trainable": true, "dtype": "float32", "filters": 22, "kernel_size": [7, 7], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 180}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "separable_conv_1_reduction_right1_stem_2", "inbound_nodes": [[["separable_conv_1_pad_reduction_right1_stem_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "separable_conv_1_bn_reduction_left1_stem_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9997, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "separable_conv_1_bn_reduction_left1_stem_2", "inbound_nodes": [[["separable_conv_1_reduction_left1_stem_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "separable_conv_1_bn_reduction_right1_stem_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9997, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "separable_conv_1_bn_reduction_right1_stem_2", "inbound_nodes": [[["separable_conv_1_reduction_right1_stem_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_13", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_13", "inbound_nodes": [[["separable_conv_1_bn_reduction_left1_stem_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_15", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_15", "inbound_nodes": [[["separable_conv_1_bn_reduction_right1_stem_2", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "separable_conv_2_reduction_left1_stem_2", "trainable": true, "dtype": "float32", "filters": 22, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 197}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "separable_conv_2_reduction_left1_stem_2", "inbound_nodes": [[["activation_13", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "separable_conv_2_reduction_right1_stem_2", "trainable": true, "dtype": "float32", "filters": 22, "kernel_size": [7, 7], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 202}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "separable_conv_2_reduction_right1_stem_2", "inbound_nodes": [[["activation_15", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_16", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_16", "inbound_nodes": [[["adjust_bn_stem_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "separable_conv_2_bn_reduction_left1_stem_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9997, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "separable_conv_2_bn_reduction_left1_stem_2", "inbound_nodes": [[["separable_conv_2_reduction_left1_stem_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "separable_conv_2_bn_reduction_right1_stem_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9997, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "separable_conv_2_bn_reduction_right1_stem_2", "inbound_nodes": [[["separable_conv_2_reduction_right1_stem_2", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "separable_conv_1_pad_reduction_right2_stem_2", "trainable": true, "dtype": "float32", "padding": [[2, 3], [2, 3]], "data_format": "channels_last"}, "name": "separable_conv_1_pad_reduction_right2_stem_2", "inbound_nodes": [[["activation_16", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_18", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_18", "inbound_nodes": [[["adjust_bn_stem_2", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "reduction_add_1_stem_2", "trainable": true, "dtype": "float32"}, "name": "reduction_add_1_stem_2", "inbound_nodes": [[["separable_conv_2_bn_reduction_left1_stem_2", 0, 0, {}], ["separable_conv_2_bn_reduction_right1_stem_2", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "separable_conv_1_reduction_right2_stem_2", "trainable": true, "dtype": "float32", "filters": 22, "kernel_size": [7, 7], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 221}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "separable_conv_1_reduction_right2_stem_2", "inbound_nodes": [[["separable_conv_1_pad_reduction_right2_stem_2", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "separable_conv_1_pad_reduction_right3_stem_2", "trainable": true, "dtype": "float32", "padding": [[1, 2], [1, 2]], "data_format": "channels_last"}, "name": "separable_conv_1_pad_reduction_right3_stem_2", "inbound_nodes": [[["activation_18", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_20", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_20", "inbound_nodes": [[["reduction_add_1_stem_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "separable_conv_1_bn_reduction_right2_stem_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9997, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "separable_conv_1_bn_reduction_right2_stem_2", "inbound_nodes": [[["separable_conv_1_reduction_right2_stem_2", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "separable_conv_1_reduction_right3_stem_2", "trainable": true, "dtype": "float32", "filters": 22, "kernel_size": [5, 5], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 233}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "separable_conv_1_reduction_right3_stem_2", "inbound_nodes": [[["separable_conv_1_pad_reduction_right3_stem_2", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "separable_conv_1_reduction_left4_stem_2", "trainable": true, "dtype": "float32", "filters": 22, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 238}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "separable_conv_1_reduction_left4_stem_2", "inbound_nodes": [[["activation_20", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_17", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_17", "inbound_nodes": [[["separable_conv_1_bn_reduction_right2_stem_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "separable_conv_1_bn_reduction_right3_stem_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9997, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "separable_conv_1_bn_reduction_right3_stem_2", "inbound_nodes": [[["separable_conv_1_reduction_right3_stem_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "separable_conv_1_bn_reduction_left4_stem_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9997, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "separable_conv_1_bn_reduction_left4_stem_2", "inbound_nodes": [[["separable_conv_1_reduction_left4_stem_2", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "reduction_pad_1_stem_2", "trainable": true, "dtype": "float32", "padding": [[0, 1], [0, 1]], "data_format": "channels_last"}, "name": "reduction_pad_1_stem_2", "inbound_nodes": [[["reduction_bn_1_stem_2", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "separable_conv_2_reduction_right2_stem_2", "trainable": true, "dtype": "float32", "filters": 22, "kernel_size": [7, 7], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 255}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "separable_conv_2_reduction_right2_stem_2", "inbound_nodes": [[["activation_17", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_19", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_19", "inbound_nodes": [[["separable_conv_1_bn_reduction_right3_stem_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_21", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_21", "inbound_nodes": [[["separable_conv_1_bn_reduction_left4_stem_2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "reduction_left2_stem_2", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "reduction_left2_stem_2", "inbound_nodes": [[["reduction_pad_1_stem_2", 0, 0, 